app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Deez Nutz"], ["description", "Almonds, cashews, peanuts and the like! "], ["created_at", "2020-07-17 16:58:43.742964"], ["updated_at", "2020-07-17 16:58:43.742964"], ["author_id", 4]]